#include "tests.h"

Tests::Tests(QObject *parent) : QObject(parent)
{

}

void Tests::testEncryption()
{
    const QString alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
    const QString alphabet_upper = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
    caesarCipher* caesar = new caesarCipher(alphabet, alphabet_upper);

    QCOMPARE(caesar->encryption("Съешь же ещё этих мягких французских булок, да выпей чаю.", 3),
             "Фэзыя йз зьи ахлш пвёнлш чугрщцкфнлш дцосн, жг еютзм ъгб.");
    QCOMPARE(caesar->encryption("Ещё трава полна прозрачных слёз, и гром вдали гремит раскатом.", 5),
             "Йюк чхеже фурте фхумхеьтаъ цркм, н зхус жиерн зхйснч хецпечус.");
    QCOMPARE(caesar->encryption("В сенях пахло свежими яблоками и висели волчьи и лисьи шкуры.", 7),
             "И шлфёь цжьтх шилнпуп ёзтхсжуп п ипшлтп ихтюгп п тпшгп ясъчв.");
    QCOMPARE(caesar->encryption("Люди сильно проголодались, лошади тоже нуждались в отдыхе?", 10),
             "Хзнт ытхёчш щъшмшхшнйхтыё, хшвйнт ьшро чэрнйхтыё л шьнеяо?");
    QCOMPARE(caesar->encryption("Ни души не попалось на пути, ни огня за ставнями!", 13),
             "Ъх раех ъс ьыьмшыюи ъм ьаях, ъх ыпъл фм юямоълщх!");
}

void Tests::testDecryption()
{
    const QString alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
    const QString alphabet_upper = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
    caesarCipher* caesar = new caesarCipher(alphabet, alphabet_upper);

    QCOMPARE(caesar->decryption("Фэзыя йз зьи ахлш пвёнлш чугрщцкфнлш дцосн, жг еютзм ъгб.", 3),
             "Съешь же ещё этих мягких французских булок, да выпей чаю.");
    QCOMPARE(caesar->decryption("Йюк чхеже фурте фхумхеьтаъ цркм, н зхус жиерн зхйснч хецпечус.", 5),
             "Ещё трава полна прозрачных слёз, и гром вдали гремит раскатом.");
    QCOMPARE(caesar->decryption("И шлфёь цжьтх шилнпуп ёзтхсжуп п ипшлтп ихтюгп п тпшгп ясъчв.", 7),
             "В сенях пахло свежими яблоками и висели волчьи и лисьи шкуры.");
    QCOMPARE(caesar->decryption("Хзнт ытхёчш щъшмшхшнйхтыё, хшвйнт ьшро чэрнйхтыё л шьнеяо?", 10),
             "Люди сильно проголодались, лошади тоже нуждались в отдыхе?");
    QCOMPARE(caesar->decryption("Ъх раех ъс ьыьмшыюи ъм ьаях, ъх ыпъл фм юямоълщх!", 13),
             "Ни души не попалось на пути, ни огня за ставнями!");
}
